# print(3+5)
# print((3+5)*3)
# print((3+5)*3+46)
# print(((3+5)*3+46)/2)
# 我们可以把运算过程中产生的值。 存储在变量中
# a = 3+5
# b = a * 3
# c = b + 46

# 变量。 在运算过程中。产生的中间值。存储在内存中。供后面的程序使用
# 命名规则：
    # 1. 变量必须由字母，数字，下划线组成
    # 2. 变量不能是数字开头， 更不能是纯数字
    # 3. 变量不能使用python的关键字。
    # 4. 变量要有意义
    # 5. 变量不要太长
    # 6. 不要用中文
    # 7. 推荐使用驼峰或者下划线命名
    # 8. 区分大小写


# ageOfOldBoy = 18

# age_of_mahuateng = 68
# n = 188 # 这个n是太白的年龄

# 注释：注释是给人看的.  机器在运行的时候回过滤掉注释
# 单行注释 马化腾昨天给我充钱了
# 腾讯要倒闭了
'''
多行注释
马化腾又要出一款更加坑人的游戏了
你们想不想体验
一下
我不想
"""这个单引号是多行注释
'''
# print("马化腾")
# print('马化腾')

# PI = 3.141592653
# PI = 4  # 常量的实质就是变量. 我们一般不去修改这样的变量
# print(PI*2)

# = 赋值的意思.  把等号右边的值。 赋值给等号左边的变量
# a = 10
# a = a + 10
# print(a)

# print() 打印的意思
# name = 10  # a 和 “a”的区别是什么 a是变量  “a” 字符串
# print("name")
# print("马化腾", "王健林", "马云")

# name="太白"
# print("name", name)













