# 数据类型
#   1.int 整数。 能计算, 能比较
#       在python中int是有范围的。但是，超过范围之后也不会报错。也能正常使用.
#   2. str 字符串。一堆字符的集合.
#       在python中所有的被引号引起来的内容都是字符串
#       字符串可以进行加法运算. 字符串连接. 两边必须是字符串
#       字符串还可以进行乘法运算. 乘法运算，重复
#   3. bool 布尔, 数学上. 命题: 真命题True，假命题False.作用就是条件判断



# s1 = '''北京欢迎您
# 我家大门常打开
# 开放怀抱等你
# 等你来开门
# 我钥匙丢了'''
# # print(type(s1))
# print(s1)


# s1 = "1"
# s2 = "1"
# print(s1 + s2)
# print("丹丹姐" * 13)    # 重复

# a = 10
# print(type(a))    # type(变量) 查看变量的数据类型

# s = "太白金星"
# print(type(s))

# b = True
# print(type(b))
